app/controllers/artists_controller.rb

INSERT INTO "artists" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 18 Aug 2015 20:42:05 UTC +00:00], ["name", "Superband"], ["updated_at", Tue, 18 Aug 2015 20:42:05 UTC +00:00]]
---
  def create
    @artist = Artist.new(artist_params)
    @user = User.find_by(email: member_params[:email])

    respond_to do |format|
      if @artist.save

UPDATE "artists" SET "name" = $1, "updated_at" = $2 WHERE "artists"."id" = 1  [["name", "Fisk"], ["updated_at", Tue, 18 Aug 2015 20:50:21 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @artist.update(artist_params)